# Создаем словарь books, который будет содержать информацию о 5 книгах
books = {
    1: {"title": "Унесенные ветром", "author": "Маргарет Митчелл", "year": 1936},
    2: {"title": "Маленький принц", "author": "Антуан де Сент-Экзюпери", "year": 1943},
    3: {"title": "Тихий Дон", "author": "Михаил Шолохов", "year": 1940},
    4: {"title": "451 градус по Фаренгейту", "author": "Рэй Брэдбери", "year": 1953},
    5: {"title": "Преступление и наказание", "author": "Фёдор Достоевский", "year": 1866}
}
# Инициализируем переменную count для отслеживания номера книги
count = 1
# Цикл for, который проходит по всем элементам словаря books
for key, book in books.items():
    # Выводим строку с информацией о текущей книге
    print("-" * 20, "Книга", count, "-" * 20)
    print("Название:", book["title"], end=", ")
    print("Автор: ", book["author"])
    print("-" * 20, book['year'], "-" * 20)
    # Увеличиваем значение count на 1
    count += 1
